{"total_comments": 21, "infavor": 11, "against": 89, "positive_comments": ["impolite boat obscene wipe mourn mighty library plate rude paint\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*"], "negative_comments": ["Tomorrow builders will protest that the government has to guarantee them 3cr per apartment otherwise they’ll protest. What foolish agendas these so called farmers have.", "Kishao ka to sirf name hai, ager problem ho rhi hai kishao ko to sirf Punjab k kishan ko q ho rhi hai or khi se to koy ata nhi hai, ye sab khalistani hai jo protest k name pe hanga ma kr rhai hai", "This is what the government gets for kneeling down in front of these rodents.", "Why aren't the farmers from bihar region who are actually poor protesting ? Why no benefit of green revolution to bihar Bengal which is the most fertile  land on planet ? Can you imagine the consequences if Delhi pollution was caused by bhaiya farmers ? Most farmers from this region are actually poor who can't even afford 3 meals let alone organizing a protest . Why religious stuff like flag in farmer protest , if something happens to these things during altercation they can weaponize and present it as religious persecution bla bla . If Muslims have done this then so call patriots have killed them but for some reason they love licking \"poor\" farmers feet .\n\"Poor\" farmers are not ready for wealth transfer . These stupid laws might result in them actually working on fing farm and their servant who are actual farmers afford another meal in their own homeland without being bullied and mocked in other state.\nIt's high time government should help actual poor Farmers who are committing suicide every other day even if it comes at the expense of someone's passport and visa funds .", "Very true.. even car makers can protest that each unsold car should be brought by government for 50% profit. What useless thugs of buffons are these.", "Very true.. even car makers can protest that each unsold car should be brought by government for 50% profit. What useless thugs of buffons are these.", "Its not that, its happening bcz the farmers are easy to brainwash, I think most of the leaders of these farmer groups are connected to politicians/rich land owners who want to use them for their gain. Just my thoughts.", "Ah yes the Namo drone didi Yojana drones in full effect against the farmers now?"], "ideas_suggestions": [], "concerns": ["Tomorrow builders will protest that the government has to guarantee them 3cr per apartment otherwise they’ll protest. What foolish agendas these so called farmers have.", "Kishao ka to sirf name hai, ager problem ho rhi hai kishao ko to sirf Punjab k kishan ko q ho rhi hai or khi se to koy ata nhi hai, ye sab khalistani hai jo protest k name pe hanga ma kr rhai hai", "This is what the government gets for kneeling down in front of these rodents.", "Very true.. even car makers can protest that each unsold car should be brought by government for 50% profit. What useless thugs of buffons are these.", "Very true.. even car makers can protest that each unsold car should be brought by government for 50% profit. What useless thugs of buffons are these.", "Its not that, its happening bcz the farmers are easy to brainwash, I think most of the leaders of these farmer groups are connected to politicians/rich land owners who want to use them for their gain. Just my thoughts.", "Ah yes the Namo drone didi Yojana drones in full effect against the farmers now?"]}